#### leverage terraform plan

```
[14:49:59]    INFO      Attempting to get temporary credentials for root account.
[14:50:01]    INFO      Using already configured temporary credentials.
null_resource.ram_enable_sharing_with_aws_organization: Refreshing state... [id=66666666666]
aws_organizations_policy.delete_protection: Refreshing state... [id=p-ffffffff]
aws_organizations_account.root: Refreshing state... [id=777777777777]
aws_organizations_organization.main: Refreshing state... [id=o-6666666]
aws_organizations_policy.standard: Refreshing state... [id=p-ggggggg]

aws_organizations_policy.default: Refreshing state... [id=p-5656556]
aws_organizations_organizational_unit.units["security"]: Refreshing state... [id=ou-xxxxxx-0r3x4pz3]
aws_organizations_organizational_unit.units["network"]: Refreshing state... [id=ou-xxxxx-xyr6h0er]
aws_organizations_organizational_unit.units["bbl_apps_devstg"]: Refreshing state... [id=ou-xxxxx-yl3npduj]
aws_organizations_organizational_unit.units["bbl_apps_prd"]: Refreshing state... [id=ou-xxxxxx-78mid8ji]
aws_organizations_organizational_unit.units["shared"]: Refreshing state... [id=ou-xxxxx-tbfuw3cz]
aws_organizations_account.accounts["shared"]: Refreshing state... [id=7777777777]
aws_organizations_policy_attachment.delete_protection["bbl_apps_devstg"]: Refreshing state... [id=ou-xxxxxx-yl3npduj:p-m6li7ssz]
aws_organizations_policy_attachment.delete_protection["bbl_apps_prd"]: Refreshing state... [id=ou-xxxxxxxxxx-78mid8ji:p-m6li7ssz]
aws_organizations_policy_attachment.policy_attachments["bbl_apps_devstg"]: Refreshing state... [id=ou-xxxxxxxxxx-yl3npduj:p-]
aws_organizations_account.accounts["apps-devstg"]: Refreshing state... [id=55555555555]
aws_organizations_account.accounts["apps-prd"]: Refreshing state... [id=88888888888]
aws_organizations_policy_attachment.delete_protection["network"]: Refreshing state... [id=ou-xxxxxxxxxx-:p-m6li7ssz]
aws_organizations_account.accounts["network"]: Refreshing state... [id=222222222]
aws_organizations_policy_attachment.delete_protection["shared"]: Refreshing state... [id=ou-xxxxxxxxxx-:p-m6li7ssz]
aws_organizations_account.accounts["security"]: Refreshing state... [id=9999999]
aws_organizations_policy_attachment.policy_attachments["bbl_apps_prd"]: Refreshing state... [id=ou-xxxxxxxxxx-78mid8ji:p-b85e42hx]
aws_organizations_policy_attachment.policy_attachments["network"]: Refreshing state... [id=ou-xxxxxxxxxx-xyr6h0er:p-up97og9o]
aws_organizations_policy_attachment.policy_attachments["security"]: Refreshing state... [id=ou-xxxxxxxxxx-0r3x4pz3:p-up97og9o]
aws_organizations_policy_attachment.policy_attachments["shared"]: Refreshing state... [id=ou-xxxxxxxxxx-tbfuw3cz:p-b85e42hx]
aws_organizations_policy.tag_protection: Refreshing state... [id=p-77777ggg]
aws_organizations_policy_attachment.tag_protection["bbl_apps_devstg"]: Refreshing state... [id=ou-xxxxxxxxxx-yl3npduj:p-7nyj6n2n]
aws_organizations_policy_attachment.tag_protection["bbl_apps_prd"]: Refreshing state... [id=ou-xxxxxxxxxx-:p-7nyj6n2n]
aws_organizations_policy_attachment.tag_protection["shared"]: Refreshing state... [id=ou-xxxxxxxxxx-tbfuw3cz:p-7nyj6n2n]
aws_organizations_policy_attachment.tag_protection["network"]: Refreshing state... [id=ou-xxxxxxxxxx-:p-7nyj6n2n]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_service_linked_role.access_analyzer will be created
  + resource "aws_iam_service_linked_role" "access_analyzer" {
      + arn              = (known after apply)
      + aws_service_name = "access-analyzer.amazonaws.com"
      + create_date      = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + path             = (known after apply)
      + tags_all         = (known after apply)
      + unique_id        = (known after apply)
    }

  # aws_organizations_delegated_administrator.access_analyzer_administrator will be created
  + resource "aws_organizations_delegated_administrator" "access_analyzer_administrator" {
      + account_id              = "9999999"
      + arn                     = (known after apply)
      + delegation_enabled_date = (known after apply)
      + email                   = (known after apply)
      + id                      = (known after apply)
      + joined_method           = (known after apply)
      + joined_timestamp        = (known after apply)
      + name                    = (known after apply)
      + service_principal       = "access-analyzer.amazonaws.com"
      + status                  = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
